beginnings = [
    "Коллеги,",
    "В то же время,",
    "Однако,",
    "Тем не менее,",
    "Следовательно,",
    "Соответственно,",
    "Вместе с тем,",
    "С другой стороны,",
]

subjects = [
    "парадигма цифровой экономики",
    "контекст цифровой трансформации",
    "диджитализация бизнес-процессов",
    "прагматичный подход к цифровым платформам",
    "совокупность сквозных технологий ",
    "программа прорывных исследований",
    "ускорение блокчейн-транзакций ",
    "экспоненциальный рост Big Data",
]

verbs = [
    "открывает новые возможности для",
    "выдвигает новые требования ",
    "несет в себе риски ",
    "расширяет горизонты",
    "заставляет искать варианты",
    "не оставляет шанса для",
    "повышает вероятность",
    "обостряет проблему",
]

actions = [
    "дальнейшего углубления",
    "бюджетного финансирования"
    "синергетического эффекта",
    "компрометации конфиденциальных",
    "универсальной коммодизации",
    "несанкционированной кастомизации",
    "нормативного регулирования",
    "практического применения",
]

ends = [
    "знаний и компетенций.",
    "непроверенных гипотез.",
    "волатильных активов.",
    "опасных экспериментов.",
    "государственно-частных партнёрств.",
    "цифровых следов граждан.",
    "нежелательных последствий.",
    "внезапных открытий.",
]
